/*1.50道MySQL经典练习题使用的测试数据表名和字段：
 *（1）学生表：Student(s_id,s_name,s_birth,s_sex);  -- 学生编号、学生姓名、出生年月、学生性别
 *（2）课程表：Course(c_id,c_name,t_id);  -- 课程编号、课程名称、教师编号
 *（3）教师表：Teacher(t_id,t_name);  #教师编号、教师姓名
 *（4）成绩表：Score(s_id,c_id,s_score);  #学生编号、课程编号、课程分数
 */
 
/*2.学生表：
 * 学生编号、学生姓名、出生年月、学生性别
 * +-------+--------+------------+-------+
 * | s_id  | s_name | s_birth    | s_sex |
 * +-------+--------+------------+-------+
 * | 01    | 赵雷   | 1990-01-01 | 男    |
 * | 02    | 钱电   | 1990-12-21 | 男    |
 * | 03    | 孙风   | 1990-05-20 | 男    |
 * | 04    | 李云   | 1990-08-06 | 男    |
 * | 05    | 周梅   | 1991-12-01 | 女    |
 * | 06    | 吴兰   | 1992-03-01 | 女    |
 * | 07    | 郑竹   | 1989-07-01 | 女    |
 * | 08    | 王菊   | 1990-01-20 | 女    |
 * +-------+--------+------------+-------+
 */

/*2.课程表：
 * 课程编号、课程名称、教师编号
 * +-------+---------+-------+
 * | c_id  | c_name  | t_id  |
 * +-------+---------+-------+
 * | 01    | 语文    | 02    |
 * | 02    | 数学    | 01    |
 * | 03    | 英语    | 03    |
 * +-------+---------+-------+
 */

/*3.教师表：
 * 教师编号、教师姓名
 * +-------+--------+
 * | t_id  | t_name |
 * +-------+--------+
 * | 01    | 张三   |
 * | 02    | 李四   |
 * | 03    | 王五   |
 * +-------+--------+
 */
 
 /*4.成绩表：
  * 学生编号、课程编号、课程分数
  * +-------+---------+---------+
  * | s_id  | c_id    | s_score |
  * +-------+---------+---------+
  * | 01    | 01      | 80      |
  * | 01    | 02      | 90      |
  * | 01    | 03      | 99      |
  * | 02    | 01      | 70      |
  * | 02    | 02      | 60      |
  * | 02    | 03      | 80      |
  * | 03    | 01      | 80      |  
  * | 03    | 02      | 80      |  
  * | 03    | 03      | 80      |  
  * | 04    | 01      | 50      |  
  * | 04    | 02      | 30      |  
  * | 04    | 03      | 20      |  
  * | 05    | 01      | 76      |  
  * | 05    | 02      | 87      |  
  * | 06    | 01      | 31      |  
  * | 06    | 03      | 34      |  
  * | 07    | 02      | 89      |  
  * | 07    | 03      | 98      |  
  * +-------+---------+---------+  
  */                               

/***************SQL语句50道经典练习题***************/

-- 1、查询"01（语文）"课程比"02（数学）"课程成绩高的学生的信息及课程分数。
-- （1）自连接：
select
	stu.*,sc01.s_score as '语文',sc02.s_score as '数学'
from 
	score sc01,score sc02,student stu
where
	sc01.c_id ='01'
and sc02.c_id ='02'
and sc01.s_id = sc02.s_id
and sc01.s_score > sc02.s_score
and stu.s_id = sc01.s_id;

-- （2）长型数据变为宽型数据：
-- 长型数据：                  宽型数据：
-- s_id | c_id | s_score       s_id | c_id=01 | c_id=02 | c_id=03
--  01  |  01  |   80           01  |   80    |    90   |   99
--  01  |  02  |   90         
--  01  |  03  |   99 
select
	student.*,
	temp.sc01 '语文',
	temp.sc02 '数学'
from
	student,
	(select 
		s_id,
		max(case when c_id ='01' then s_score end) sc01,
		max(case when c_id ='02' then s_score end) sc02
	from score
	group by s_id) temp
where 
	student.s_id = temp.s_id
and temp.sc01 > temp.sc02;
